app/controllers/assessments_controller.rb

SELECT "assessments".* FROM "assessments"
---
  def index
    @assessments = Assessment.all

INSERT INTO "assessments" ("medically_stable", "rehab_in_short_term", "discharge_destination", "requires_level_of_nursing_care", "housing_issues", "under_age_18", "mental_health_problems", "requires_respite_care", "requires_long_term_placement", "created_at", "updated_at", "patient_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @assessment = Assessment.new(assessment_params)

    if @assessment.save