app/controllers/beds_controller.rb

  def index
    @beds = Bed.all
---
SELECT "beds".* FROM "beds"

  def create
    @bed = Bed.new(bed_params)

    if @bed.save
---
INSERT INTO "beds" ("hospital_name", "hospital_location", "beds_available", "created_at", "updated_at", "patient_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"