app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" WHERE (first_name ILIKE '%rick%' OR last_name ILIKE '%rick%' OR diagnosis ILIKE '%rick%' OR patient_no ILIKE '%rick%')
---
  def index
    @patients = Patient.all

INSERT INTO "patients" ("patient_no", "first_name", "last_name", "diagnosis", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["patient_no", 121212212], ["first_name", "patient"], ["last_name", "1"], ["diagnosis", "cancer"], ["created_at", 2017-02-15 16:54:34 UTC], ["updated_at", 2017-02-15 16:54:34 UTC]]
---
  def create
    @patient = Patient.new(patient_params)
    @patient.user = current_user

    if @patient.save