app/controllers/pocs_controller.rb

  def index
    @pocs = Poc.all
---
SELECT "pocs".* FROM "pocs"

  def create
    @poc = Poc.new(poc_params)

    if @poc.save
---
INSERT INTO "pocs" ("home_care", "meals_on_wheels", "frozen_meals", "day_care", "day_hospital", "district_nurse", "physio", "residential_home", "nursing_home", "other", "notes", "created_at", "updated_at", "patient_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"